function generate() {
  var user_name = ["نجيب محفوظ",
   "جبران خليل جبران", 
   "بن زيدون",
   "ابن سليمان",
   "ابن الفارض",
   "ارسطو",
   " هزلية",
   "مصطفي محمود",
   " نجيب محفوظ",
   " دوستويفسكي"
   
];

  var text = [
    "القراءة هي نافذة تفتح على عالم جديد",
    "الكتب هي الأصدقاء الوحيدين الذين لا يتغيرون ولا يتخلى عنهم الإنسان",
    "وكيف يلد الوردُ وفي الخدِّ زُرٌّ، ومن ليس يعشقُ الزهراءَ لا يُلدِ",
    "إن الزمانَ يسرق السرورَ، ويُخفي ... كالمحامي الذي يُدركُ بالكيدِ الحرازِ",
    "لا تتبع الهوى فإن الهوى زائل ... وقد كان أول من تبعه مضى",
    "معرفه نفسك هي بدايه كل حكمه",
    "إن كنت لا تستطيع شيئًا، فاستمتع بكل شيء" ,
    "قد تكون السعاده في ترك الاشياء بدل من الحصول عليها",
    " اذا كان الماضي  لا يستحق الحديث فلنصنع مستقبلا يستحق ان يحكي" ,
    "الإنسان العظيم هو الذي يتعلم من كل شخص."   
  ];
  var img = ["../12.jpg"];
  var num = Math.floor(Math.random() * user_name.length);
  document.getElementById("text").innerHTML = text[num] ;
    document.getElementById("author").innerHTML= user_name[num];
    document.getElementById("demo").src=img[num];
}
